시리즈와 데이터프레임 데이터 생성

In [4]:
import pandas as pd

In [5]:
s=pd.Series() #=> Series의 객체가 만들어진다!
#클래스이름() : 생성자 함수(매서드, 클래스이름과 동일한 함수)
# ex) 붕어빵기계() : 기본붕어빵 / 붕어빵기계('설탕') : 설탕붕어빵 / 붕어빵기계('크림'); 크림 붕어빵

In [6]:
s

Series([], dtype: float64)

In [9]:
s=pd.Series(['banana',40])
# 기본적으로 인덱스는 0부터 부여됨
#바나나 문자열이 들어간 Series가 만들어짐(0은 인덱스, 데이터는 banana)
s

0    banana
1        40
dtype: object

In [10]:
s=pd.Series(['banana',40],index=[5,10]) # 인덱스를 직접 지정(5번, 10번으로!)
s

5     banana
10        40
dtype: object

In [12]:
s=pd.Series(['banana',40],index=['first','second']) # 문자로 인덱스 지정도 가능(first, second 형식으로!)
s

first     banana
second        40
dtype: object

In [13]:
s[0] #행 번호 사용도 가능

'banana'

In [14]:
s['first'] #문자열 지정했으면 더불어 사용 가능

'banana'

데이터 프레임 만들기

In [25]:
people=pd.DataFrame({
    'Name':['Kim','Lee'],  #키와 2개의 벨류 지정할 때, 대괄호로 묶어 리스트 형태로 바꾸어준다
    'Occupation':['Student','Chemiset'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,61]}) #딕셔너리를 데이터프레임 생성자 함수에 작성
#데이터프레임도 생성시 인덱스를 부여하지 않으면 0번부터 자동으로 부여된다
#데이터는 입력한 순서대로 만들어진다

In [26]:
people

  Name Occupation        Born        Died  Age
0  Kim    Student  1920-07-25  1958-04-16   37
1  Lee   Chemiset  1876-06-13  1937-10-16   61

In [27]:
#성으로 인덱스 지정하기
people=pd.DataFrame({
    'Occupation':['Student','Chemiset'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,61]},index=['Kim' ,'Lee'])

In [28]:
people

    Occupation        Born        Died  Age
Kim    Student  1920-07-25  1958-04-16   37
Lee   Chemiset  1876-06-13  1937-10-16   61

In [31]:
#Age와 Died의 순서를 바꾸기
people=pd.DataFrame({
    'Occupation':['Student','Chemiset'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,61]},index=['Kim' ,'Lee'],
columns=['Occupation','Born','Age','Died']
)

In [32]:
people

    Occupation        Born  Age        Died
Kim    Student  1920-07-25   37  1958-04-16
Lee   Chemiset  1876-06-13   61  1937-10-16

In [35]:
first_row=people.loc['Lee']
type(first_row)
#Series 자료형인데 object로 나옴 => 그럼에도 Series 함수가 맞음

pandas.core.series.Series

In [36]:
first_row

Occupation      Chemiset
Born          1876-06-13
Age                   61
Died          1937-10-16
Name: Lee, dtype: object

In [37]:
first_row.index #인덱스를 추출하는 속성(행에 대한 인덱스가 쫘륵 나옴)

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [39]:
first_row.values

array(['Chemiset', '1876-06-13', 61, '1937-10-16'], dtype=object)

In [41]:
first_row.keys() #함수이기 때문에 소괄호() 붙인다 / 인덱스 추출은 index, keys 함수 사용
#인덱스 개체도 cbject

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [43]:
first_row.keys()[0]

'Occupation'

In [44]:
ages=people['Age']
ages

Kim    37
Lee    61
Name: Age, dtype: int64

In [45]:
ages.mean() #평균값

49.0

In [46]:
ages.min() #최소값

37

In [47]:
ages.max() #최대값

61

In [48]:
ages.std() #표준편차

16.97056274847714

In [49]:
scientists=pd.read_csv("data/scientists.csv")

In [50]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [51]:
#[문제] Age 열 컬럼만 찾아서 ages에 대입하라
ages=scientists['Age']

In [52]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [53]:
#[문제] 가장 나이 많은 사람 추출
ages.max()

90

In [54]:
ages.mean()

59.125

불린 추출: 특정 조건을 만족하는 값만 추출

In [56]:
#평균 나이보다 나이가 많은 사람의 데이터를 추출
#불린 : True of False
#즉, 조건이 참인 것들만 뽑아내는 것

In [57]:
ages>ages.min() #=> 평균보다 크면 True 아니면 False
#조건을 줘서 '불린값'만 추출한 것임

0    False
1     True
2     True
3     True
4     True
5     True
6     True
7     True
Name: Age, dtype: bool

In [58]:
type(ages>ages.min()) #불린값을 가진 series 개체

pandas.core.series.Series

In [64]:
ages[ages>ages.mean()] #조건식을 만족한 값들만 출력(불린추출)
#브로드캐스팅(broadcasting:1개 -> 8개로 확장 -> 비교 수행)
# 데이터가 비교해야 할 대상만큼 확장(복제)하게 되는 것을 '브로드캐스팅'이라고 함

# 스칼라 : 값이 하나인 것(0차원)
# 백터: 값이 여러개가 나열된 것(1차원)   -> 5,10,20,40,...(행 백터, 열 백터가 있음)
# 행렬 : 백터가 여러개로 합쳐져서 구성된 것(2차원)
#array : (다차원)

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [62]:
ages[[True,True,False,True,True,True,True,True]] #True 값만 추출, False값은 제외

0    37
1    61
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [65]:
ages #백터

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [66]:
ages+ages  #백터 간 덧셈(동일한 인덱스에 있는 값들끼리 덧셈)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [67]:
ages*ages #백터 요소간 곱셈(element wise product), 백터의 내적

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [70]:
ages+100
# 100이 스칼라, 100이 ages의 길이만큼 broadcasting 된다!

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [72]:
pd.Series([1,100]) #백터

0      1
1    100
dtype: int64

In [76]:
ages+pd.Series([1,100])
# 백터와 스칼라를 연산 -> 스칼라 값에 대한 브로드캐스팅 -> 연산
# 백터와 백터간 연산 -> 인덱스가 일치한(동일한) 0과 1번만 계산

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [77]:
pd.Series([1,100],index=[3,2000])

3         1
2000    100
dtype: int64

In [78]:
ages+pd.Series([1,100],index=[3,2000]) 
# 인덱스가 동일하지 않으므로(일치하는 백터가 없기 때문에) NaN

0        NaN
1        NaN
2        NaN
3       67.0
4        NaN
5        NaN
6        NaN
7        NaN
2000     NaN
dtype: float64

NaN:누락값

In [82]:
# NaN값과 연산을 수행하면 결과값도 NaN이 나옴(Not a number : 숫자가 아닌 값)

In [85]:
ages #인덱스를 기준으로 오름차순 정렬

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [86]:
rev_ages=ages.sort_index(ascending=False)
#ascending True 오름차순 정렬, False 내림차순 정렬

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [90]:
ages.sort_values(ascending=True) #데이터 기준 오름차순 정렬
# 내림차순 하려면 ascending False

0    37
6    41
5    45
4    56
1    61
3    66
7    77
2    90
Name: Age, dtype: int64

In [96]:
scientists
# [문제] 평균 나이보다 값이 큰 나이를 갖는 사람들만 출력 불린 추출
scientists[scientists['Age']>scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [97]:
scientists.loc[[True,True,False,True]]  #0,1,3번 추출

                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician
3        Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [99]:
scientists*2 #데이터 프레임에 대한 곱셈 => 문자열 2번 반복, 정수는 2배 출력

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [101]:
# [문제] Series를 생성해서 a변수에 대입하도록 작성하시오(도시명 index, 수치 data)
# 서울 : 9904312
# 부산 : 3448737
# 인천 : 2890451
# 대구 : 2466052

In [136]:
s=pd.Series([904312,3448737,2890451,2466052],index=['서울','부산','인천','대구'])
s

서울     904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [137]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [138]:
s.values

array([ 904312, 3448737, 2890451, 2466052], dtype=int64)

In [139]:
s.name='인구' #시리즈 데이터에 이름이 붙음
s

서울     904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [140]:
s.index.name='도시명'
s

도시명
서울     904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [141]:
#[문제] 100만 단위로 인구가 출력되도록 코드 작성
# 9004312 ->9.904312
s/1000000 #인덱스는 연산 X, 데이터만 연산 수행

도시명
서울    0.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [142]:
#[문제] 부산인구만 추출
s['부산']

3448737

In [143]:
s[0]

904312

In [144]:
s[[0,3]] # 열 2개 이상이면 []대괄호 무조건!

도시명
서울     904312
대구    2466052
Name: 인구, dtype: int64

In [145]:
#서울 다음에 부산이 오게 한다
s[['서울','대구','부산']]

도시명
서울     904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [146]:
s[(2500000>s)]

도시명
서울     904312
대구    2466052
Name: 인구, dtype: int64

In [147]:
s[(5000000<s)]

Series([], Name: 인구, dtype: int64)

In [151]:
#250만 이상 500만 이하인 도시를 선택한다
s[(2500000>s)&(5000000<s)]

Series([], Name: 인구, dtype: int64)

In [152]:
s[(250e4>s)&(500e4<s)] #e4 :10의 4승

Series([], Name: 인구, dtype: int64)

In [153]:
s

도시명
서울     904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [156]:
s[1:3] #컬럼 인덱스의 범위를 지정할 수 있다 / 범위를 나타낼 때는 범위를 사용하지 않음/ : 기호 뒤의 위치는 포함 안됨

도시명
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [157]:
s['부산':'대구'] # 숫자로 지정할때와 다르게 부산-대구까지 나옴

도시명
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [163]:
s2=pd.Series(range(10,13))

In [164]:
s2

0    10
1    11
2    12
dtype: int64

In [170]:
#[문제] 행 인덱스를 a,b,c로 설정
s2=pd.Series(range(10,13), index=['a','b','c']) 
s2

a    10
b    11
c    12
dtype: int64

In [168]:
s2[1]

11

In [169]:
#인덱스가 영문자로 된 경우에는 점으로도 접근 가능
s2.a

10

In [171]:
s

도시명
서울     904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [173]:
"서울" in s # '서울' 인덱스가 있습니까?

True

In [178]:
print(s.values)
print(s.index)
print(s.items()) #items : values와 index를 함께 추출할 수 있게 해주는 함수 / 인덱스와 데이터가 모두 추출

[ 904312 3448737 2890451 2466052]
Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시명')
<zip object at 0x00000206A514AD88>

In [181]:
for k,v in s.items(): #인덱스와 데이터가 각각 k,v 변수에 전달됨
    print(k,v)

서울 904312
부산 3448737
인천 2890451
대구 2466052

In [186]:
s2=pd.Series([9600000,3300000,2600000,1500000],
             index=['서울','부산','인천','대전'])
s

도시명
서울     904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [187]:
s2

서울    9600000
부산    3300000
인천    2600000
대전    1500000
dtype: int64

In [199]:
#두개의 시리즈로 인덱스 기반 연산 진행
# 두 변수의 차이를 구한다
ds=s-s2
ds
# s, s2 모두 다 가지고 있는 인덱스에 대한 데이터만 연산을 수행
#Nan이 포함되어있는 경우에는 연산결과가 float으로 나옴

대구          NaN
대전          NaN
부산     148737.0
서울   -8695688.0
인천     290451.0
dtype: float64

In [200]:
ds.notnull() #null: 값이 없는 것, null이 아니냐?(값이 있느냐?)

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [201]:
ds[ds.notnull()] #Non이 아닌 값들만 추출

부산     148737.0
서울   -8695688.0
인천     290451.0
dtype: float64

In [207]:
rs=(s-s2)/s2*100
rs=rs[rs.notnull()]
rs 
#rs : 각 지역 인구의 감소율

부산     4.507182
서울   -90.580083
인천    11.171192
dtype: float64

In [212]:
rs['대구']=1.4 #데이터 추가
rs

부산     1.630000
인천    11.171192
대구     1.400000
dtype: float64

In [213]:
rs['부산']=1.63
rs

부산     1.630000
인천    11.171192
대구     1.400000
dtype: float64

In [210]:
del rs['서울'] #데이터 삭제
rs

부산     1.630000
인천    11.171192
대구     1.400000
dtype: float64

In [215]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns2 = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index2 = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index2, columns=columns2)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [217]:
#값들만 뽑아내려고 할 때,
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [218]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [219]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [222]:
df.index.name='도시'
df.columns.name='속성'
df

속성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [223]:
df.T #전치행렬 : 행 인덱스 바꾸기

도시                  서울       부산       인천       대구
속성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [226]:
#지역의 열 백터를 추출하고 싶을 때
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [229]:
df[['2010','2015']]

속성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [230]:
type(df[['2010','2015']])

pandas.core.frame.DataFrame

In [235]:
type(df['2010']) #Series

pandas.core.series.Series

In [236]:
type(df[['2010']]) #DataFrame

pandas.core.frame.DataFrame